/*
SQLyog Ultimate v8.32 
MySQL - 5.6.33 : Database - dbgirl
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`dbgirl` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_bin */;

USE `dbgirl`;

/*Table structure for table `girl` */

DROP TABLE IF EXISTS `girl`;

CREATE TABLE `girl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cup_size` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `name` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `girl` */

/*Table structure for table `hero` */

DROP TABLE IF EXISTS `hero`;

CREATE TABLE `hero` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(2) DEFAULT NULL,
  `name` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `createtime` datetime DEFAULT NULL,
  `describe` varchar(512) COLLATE utf8_bin DEFAULT NULL,
  `skill` varchar(512) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `hero` */

insert  into `hero`(`id`,`type`,`name`,`createtime`,`describe`,`skill`) values (1,1,'王昭君','2018-01-01 00:00:00','王昭君，《王者荣耀》中的一位女性法师英雄，擅长团控，在团战中有很大的作用，喜好梅花。','冰封之心、凋零冰晶、禁锢寒霜、凛冬已至'),(2,3,'蔡文姬','2018-04-09 16:34:56','',''),(3,1,'甄姬','2018-04-09 16:40:22','甄姬是《王者荣耀》中一位性价比很高的法师英雄。甄姬擅长使用水来控制和伤害敌人，可以说具有强大的团控和控制能力，况且本身的输出也很高，可以用2技能打出多段伤害，不要试图追杀敌方残血，要在后排尽最大可能控制敌人，协助队友完成击杀。甄姬在游戏中以成熟御姐的形象出现，有着不俗的攻击伤害和技能效果，而且团控能力也十分出色，能很好的配合队友对敌人造成毁灭性的的打击。往往逆风局中，甄姬的大招配合被动可以让敌人全部被冰冻，从而完成Carry。','凝泪成冰，泪如泉涌，叹息水流，洛神降临'),(4,1,'甄姬','2018-04-09 16:40:23','甄姬是《王者荣耀》中一位性价比很高的法师英雄。甄姬擅长使用水来控制和伤害敌人，可以说具有强大的团控和控制能力，况且本身的输出也很高，可以用2技能打出多段伤害，不要试图追杀敌方残血，要在后排尽最大可能控制敌人，协助队友完成击杀。甄姬在游戏中以成熟御姐的形象出现，有着不俗的攻击伤害和技能效果，而且团控能力也十分出色，能很好的配合队友对敌人造成毁灭性的的打击。往往逆风局中，甄姬的大招配合被动可以让敌人全部被冰冻，从而完成Carry。','凝泪成冰，泪如泉涌，叹息水流，洛神降临'),(6,1,'甄姬','2018-04-09 16:43:28','甄姬是《王者荣耀》中一位性价比很高的法师英雄。甄姬擅长使用水来控制和伤害敌人，可以说具有强大的团控和控制能力，况且本身的输出也很高，可以用2技能打出多段伤害，不要试图追杀敌方残血，要在后排尽最大可能控制敌人，协助队友完成击杀。甄姬在游戏中以成熟御姐的形象出现，有着不俗的攻击伤害和技能效果，而且团控能力也十分出色，能很好的配合队友对敌人造成毁灭性的的打击。往往逆风局中，甄姬的大招配合被动可以让敌人全部被冰冻，从而完成Carry。','凝泪成冰，泪如泉涌，叹息水流，洛神降临'),(7,1,'甄姬','2018-04-09 16:53:00','甄姬是《王者荣耀》中一位性价比很高的法师英雄。甄姬擅长使用水来控制和伤害敌人，可以说具有强大的团控和控制能力，况且本身的输出也很高，可以用2技能打出多段伤害，不要试图追杀敌方残血，要在后排尽最大可能控制敌人，协助队友完成击杀。甄姬在游戏中以成熟御姐的形象出现，有着不俗的攻击伤害和技能效果，而且团控能力也十分出色，能很好的配合队友对敌人造成毁灭性的的打击。往往逆风局中，甄姬的大招配合被动可以让敌人全部被冰冻，从而完成Carry。','凝泪成冰，泪如泉涌，叹息水流，洛神降临'),(8,1,'甄姬','2018-04-09 16:54:23','甄姬是《王者荣耀》中一位性价比很高的法师英雄。甄姬擅长使用水来控制和伤害敌人，可以说具有强大的团控和控制能力，况且本身的输出也很高，可以用2技能打出多段伤害，不要试图追杀敌方残血，要在后排尽最大可能控制敌人，协助队友完成击杀。甄姬在游戏中以成熟御姐的形象出现，有着不俗的攻击伤害和技能效果，而且团控能力也十分出色，能很好的配合队友对敌人造成毁灭性的的打击。往往逆风局中，甄姬的大招配合被动可以让敌人全部被冰冻，从而完成Carry。','凝泪成冰，泪如泉涌，叹息水流，洛神降临'),(9,1,'甄姬','2018-04-09 17:11:18','甄姬是《王者荣耀》中一位性价比很高的法师英雄。甄姬擅长使用水来控制和伤害敌人，可以说具有强大的团控和控制能力，况且本身的输出也很高，可以用2技能打出多段伤害，不要试图追杀敌方残血，要在后排尽最大可能控制敌人，协助队友完成击杀。甄姬在游戏中以成熟御姐的形象出现，有着不俗的攻击伤害和技能效果，而且团控能力也十分出色，能很好的配合队友对敌人造成毁灭性的的打击。往往逆风局中，甄姬的大招配合被动可以让敌人全部被冰冻，从而完成Carry。','凝泪成冰，泪如泉涌，叹息水流，洛神降临');

/*Table structure for table `news` */

DROP TABLE IF EXISTS `news`;

CREATE TABLE `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `content` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `publishtime` datetime DEFAULT NULL,
  `title` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `username` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=94 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `news` */

insert  into `news`(`id`,`content`,`publishtime`,`title`,`username`) values (1,'新闻1','2018-02-07 10:14:39','标题1','李袁'),(2,'新闻2','2018-02-07 10:14:59','标题2','李袁'),(3,'新增的哦','2018-02-07 10:57:06','比气体','王昭君'),(4,'新闻3','2018-02-12 15:06:14','标题3','李袁'),(5,'新闻2','2018-02-12 15:13:55','标题2','李袁'),(6,'新闻2','2018-02-12 15:14:02','标题2','李袁'),(7,'新闻2','2018-02-12 15:14:30','标题2','李袁'),(8,'新闻2','2018-02-12 15:29:15','标题2','李袁'),(9,'新闻2','2018-02-12 15:29:18','标题2','李袁'),(10,'新闻2','2018-02-12 15:29:28','标题2','李袁'),(11,'新闻2','2018-02-12 15:29:49','标题2','李袁'),(12,'新闻2','2018-02-12 15:30:39','标题2','李袁'),(13,'新闻2','2018-02-12 15:30:55','标题2','李袁'),(14,'新闻2','2018-02-12 15:31:33','标题2','李袁'),(15,'新闻2','2018-02-12 15:32:17','标题2','李袁'),(16,'新闻2','2018-02-12 15:33:19','标题2','李袁'),(17,'新闻2','2018-02-12 15:35:36','标题2','李袁'),(18,'新闻2','2018-02-12 15:35:51','标题2','李袁'),(19,'新闻2','2018-02-12 15:36:18','标题2','李袁'),(20,'新闻2','2018-02-12 15:54:27','标题2','李袁'),(21,'新闻2','2018-02-12 15:54:47','标题2','李袁'),(22,'新闻2','2018-02-12 15:55:27','标题2','李袁'),(23,'新闻2','2018-02-12 15:55:36','标题2','李袁'),(24,'新闻2','2018-02-12 16:07:26','标题2','李袁'),(25,'新闻2','2018-02-12 16:08:34','标题2','李袁'),(26,'新闻2','2018-02-12 16:09:18','标题2','李袁'),(27,'新闻2','2018-02-12 16:09:32','标题2','李袁'),(28,'新闻2','2018-02-12 16:11:56','标题2','李袁'),(29,'新闻2','2018-02-12 16:12:09','标题2','李袁'),(30,'新闻2','2018-02-12 16:12:21','标题2','李袁'),(31,'新闻2','2018-02-12 16:17:27','标题2','李袁'),(32,'新闻2','2018-02-12 16:18:12','标题2','李袁'),(33,'新闻2','2018-02-12 16:25:45','标题2','李袁'),(34,'新闻2','2018-02-12 16:25:50','标题2','李袁'),(35,'新闻2','2018-02-12 16:26:03','标题2','李袁'),(36,'新闻2','2018-02-12 16:26:21','标题2','李袁'),(37,'新闻2','2018-02-12 16:29:39','标题2','李袁'),(38,'新闻2','2018-02-12 16:30:20','标题2','李袁'),(39,'新闻2','2018-02-12 16:30:30','标题2','李袁'),(40,'新闻2','2018-02-12 16:30:53','标题2','李袁'),(41,'新闻2','2018-02-12 16:31:06','标题2','李袁'),(42,'新闻2','2018-02-12 16:31:10','标题2','李袁'),(43,'新闻2','2018-02-12 16:34:05','标题2','李袁'),(44,'新闻2','2018-02-12 16:34:28','标题2','李袁'),(45,'新闻2','2018-02-12 16:35:32','标题2','李袁'),(46,'新闻2','2018-02-12 16:35:38','标题2','李袁'),(47,'新闻2','2018-02-12 16:35:44','标题2','李袁'),(48,'新闻2','2018-02-12 16:35:46','标题2','李袁'),(49,'新闻2','2018-02-12 16:35:59','标题2','李袁'),(50,'新闻2','2018-02-12 16:36:09','标题2','李袁'),(51,'新闻2','2018-02-12 16:36:15','标题2','李袁'),(52,'新闻2','2018-02-12 16:37:39','标题2','李袁'),(53,'新闻2','2018-02-12 16:39:13','标题2','李袁'),(54,'新闻2','2018-02-12 16:39:21','标题2','李袁'),(55,'新闻2','2018-02-12 16:40:18','标题2','李袁'),(56,'新闻2','2018-02-12 16:40:31','标题2','李袁'),(57,'新闻2','2018-02-12 16:41:28','标题2','李袁'),(58,'新闻2','2018-02-12 16:42:00','标题2','李袁'),(59,'新闻2','2018-02-12 16:42:03','标题2','李袁'),(60,'新闻2','2018-02-12 16:42:32','标题2','李袁'),(61,'新闻2','2018-02-12 16:44:49','标题2','李袁'),(62,'新闻2','2018-02-12 16:47:31','标题2','李袁'),(63,'新闻2','2018-02-12 16:47:37','标题2','李袁'),(64,'新闻2','2018-02-12 16:47:47','标题2','李袁'),(65,'新闻2','2018-02-12 16:48:19','标题2','李袁'),(66,'新闻2','2018-02-12 16:49:26','标题2','李袁'),(67,'新闻2','2018-02-12 16:49:38','标题2','李袁'),(68,'新闻2','2018-02-12 16:49:56','标题2','李袁'),(69,'新闻2','2018-02-12 16:50:52','标题2','李袁'),(70,'新闻2','2018-02-12 16:51:25','标题2','李袁'),(71,'新闻3','2018-03-01 16:43:24','标题3','李袁'),(72,'新闻3','2018-03-01 16:43:51','标题3','李袁'),(73,'新闻3','2018-03-01 16:45:13','标题3','李袁'),(74,'新闻3','2018-03-01 16:45:14','标题3','李袁'),(75,'赵丽颖宣布恋情','2018-03-02 10:04:34','赵丽颖谈恋爱了','李袁'),(76,'赵丽颖宣布恋情','2018-03-02 10:05:28','赵丽颖谈恋爱了','李袁'),(77,'赵丽颖宣布恋情','2018-03-02 10:06:20','赵丽颖谈恋爱了','李袁'),(78,'赵丽颖宣布恋情','2018-03-02 10:06:30','赵丽颖谈恋爱了','李袁'),(79,'赵丽颖宣布恋情','2018-03-02 10:11:22','赵丽颖谈恋爱了','李袁'),(80,'赵丽颖宣布恋情','2018-03-02 10:16:29','赵丽颖谈恋爱了','李袁'),(81,'赵丽颖宣布分手','2018-03-02 11:38:26','赵丽颖分手了','李袁'),(82,'赵丽颖宣布分手','2018-03-02 11:53:44','赵丽颖分手了','李袁'),(83,'赵丽颖宣布分手','2018-03-02 13:45:41','赵丽颖分手了','李袁'),(84,'赵丽颖宣布分手','2018-03-02 13:46:09','赵丽颖分手了','李袁'),(85,'赵丽颖宣布分手','2018-03-02 13:46:15','赵丽颖分手了','李袁'),(86,'赵丽颖宣布分手','2018-03-02 13:50:30','赵丽颖分手了','李袁'),(87,'赵丽颖宣布分手','2018-03-02 13:50:38','赵丽颖分手了','李袁'),(88,'赵丽颖宣布分手','2018-03-02 13:53:58','赵丽颖分手了','李袁'),(89,'赵丽颖宣布分手','2018-03-02 13:54:16','赵丽颖分手了','李袁'),(90,'赵丽颖宣布分手','2018-03-02 13:55:04','赵丽颖分手了','李袁'),(91,'赵丽颖宣布分手','2018-03-02 14:03:05','赵丽颖分手了','李袁'),(92,'赵丽颖宣布分手','2018-03-02 14:03:25','赵丽颖分手了','李袁'),(93,'赵丽颖宣布分手','2018-03-07 16:56:12','赵丽颖分手了','李袁');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
